Repository: RaedMsood/Booking
Catalog: lib/l10n/intl_*.arb
Languages: ar

# ppS6_3
source: After an account deletion request, we delete or anonymize data within a reasonable time unless legal retention is required.
ar: بعد طلب حذف الحساب، نقوم بحذف البيانات أو إخفاء هويتها خلال مدة معقولة ما لم يوجد التزام قانوني بالاحتفاظ.

# ppSection7Title
source: 7) Data Security
ar: 7) حماية البيانات

# ppS7_1
source: We apply appropriate technical and organizational measures to protect data from unauthorized access, alteration, or loss.
ar: نطبق إجراءات تقنية وتنظيمية مناسبة لحماية البيانات من الوصول غير المصرح به أو التعديل أو الفقدان.

# ppS7_2
source: Data is transmitted over encrypted connections when available (e.g., HTTPS).
ar: يتم نقل البيانات عبر اتصال مشفر عند توفره (مثل HTTPS).

# ppS7_3
source: No method is 100% secure, but we continuously improve our security controls.
ar: لا توجد طريقة نقل/تخزين آمنة 100%، لكننا نعمل باستمرار على تحسين الضوابط الأمنية.

# ppSection8Title
source: 8) Your Rights (Access/Update/Delete)
ar: 8) حقوقك (الوصول/التعديل/الحذف)

# ppS8Intro
source: You have the right to:
ar: يحق لك:

# ppS8_1
source: Update your data within the app.
ar: تحديث بياناتك داخل التطبيق.

# ppS8_2
source: Request correction of inaccurate data.
ar: طلب تصحيح البيانات غير الدقيقة.

# ppS8_3
source: Request account deletion and deletion of related data.
ar: طلب حذف الحساب والبيانات المرتبطة به.

# ppS8_4
source: Disable notifications in device settings.
ar: إيقاف الإشعارات من إعدادات الجهاز.

# ppDeleteAccountTitle
source: Account Deletion
ar: حذف الحساب

# ppDeleteAccountInAppPath
source: You can delete your account inside the app via: Delete Account → General Settings.
ar: يمكنك حذف الحساب من داخل التطبيق عبر: حذف الحساب → الإعدادات العامة.

# ppDeleteAccountLinkLabel
source: Account & Data Deletion Page
ar: صفحة حذف الحساب والبيانات

# ppSection9Title
source: 9) Children’s Privacy
ar: 9) سياسة الأطفال

# ppS9_1
source: The app is not intended for children under 13.
ar: التطبيق غير موجه للأطفال دون سن 13 عامًا.

# ppS9_2
source: We do not knowingly collect personal data from children.
ar: لا نجمع بيانات شخصية للأطفال عن قصد.

# ppS9_3
source: If we learn that a child’s data was collected, we will delete it promptly.
ar: إذا تبيّن لنا جمع بيانات لطفل، سنقوم بحذفها فورًا.

# ppSection10Title
source: 10) Policy Updates
ar: 10) التعديلات على السياسة

# ppS10_1
source: We may update this policy from time to time. The updated version will be published with an updated "Last update" date. Material changes may be notified inside the app.
ar: قد نقوم بتحديث هذه السياسة من وقت لآخر. سيتم نشر النسخة المحدثة مع تحديث تاريخ "آخر تحديث"، وعند إجراء تغييرات جوهرية قد نقوم بإشعار المستخدم داخل التطبيق.

# ppSection11Title
source: 11) Contact Us
ar: 11) التواصل معنا

# ppS11_1
source: For privacy policy inquiries:
ar: للاستفسارات المتعلقة بسياسة الخصوصية:

# ppEmailLabel
source: Email
ar: البريد الإلكتروني

# ppFooterNote
source: Last update: Jan 29, 2026. Practices may vary by country or local regulations, and applicable legal requirements will be followed.
ar: آخر تحديث: 29 يناير 2026. قد تختلف الممارسات حسب البلد أو اللوائح المحلية، وسيتم الالتزام بالمتطلبات القانونية المطبقة.

# termsTitle
source: Terms & Conditions
ar: الشروط والأحكام

# termsIntro
source: Please read these terms and conditions carefully before using Mazaji. By using the app, you agree to comply with the following.
ar: يرجى قراءة هذه الشروط والأحكام بعناية قبل استخدام تطبيق مزاجي. باستخدامك للتطبيق فإنك توافق على الالتزام بما يلي.

# termsSection1Title
source: 1. App Usage
ar: 1. استخدام التطبيق

# termsSection1Item1
source: The app is intended for booking accommodations and related services.
ar: التطبيق مخصص لحجز أماكن الإقامة والخدمات المرتبطة بها.

# termsSection1Item2
source: The app must be used for lawful purposes only.
ar: يجب استخدام التطبيق لأغراض مشروعة فقط.

# termsSection1Item3
source: Misuse of the app or attempts to manipulate bookings or systems are prohibited.
ar: يمنع إساءة استخدام التطبيق أو محاولة التلاعب بالحجوزات أو الأنظمة.

# termsSection2Title
source: 2. Accounts
ar: 2. الحسابات

# termsSection2Item1
source: The user is responsible for the accuracy of the provided information.
ar: المستخدم مسؤول عن صحة البيانات المدخلة.

# termsSection2Item2
source: The user is responsible for keeping their account information confidential.
ar: يتحمل المستخدم مسؤولية الحفاظ على سرية معلومات حسابه.

# termsSection2Item3
source: Management reserves the right to suspend or disable any violating account.
ar: يحق للإدارة تعليق أو إيقاف أي حساب مخالف.

# termsSection3Title
source: 3. Bookings
ar: 3. الحجوزات

# termsSection3Item1
source: All bookings are subject to room availability at the hotel.
ar: جميع الحجوزات تخضع لتوفر الغرف لدى الفندق.

# termsSection3Item2
source: The app acts as an intermediary between the user and the hotel.
ar: يعمل التطبيق كوسيط بين المستخدم والفندق.

# termsSection3Item3
source: The hotel is responsible for delivering the agreed service.
ar: الفندق هو المسؤول عن تنفيذ الخدمة المتفق عليها.

# termsSection4Title
source: 4. Pricing and Payments
ar: 4. الأسعار والدفع

# termsSection4Item1
source: Prices are set by the hotel.
ar: الأسعار يتم تحديدها من قبل الفندق.

# termsSection4Item2
source: Prices may vary by season or availability.
ar: قد تختلف الأسعار حسب الموسم أو التوفر.

# termsSection4Item3
source: The app is not responsible for changes made by the hotel after booking confirmation.
ar: التطبيق غير مسؤول عن أي تغيير يطرأ من قبل الفندق بعد تأكيد الحجز.

# termsSection5Title
source: 5. Disclaimer
ar: 5. إخلاء المسؤولية

# termsSection5Item1
source: The app is not responsible for direct disputes between the user and the hotel.
ar: التطبيق غير مسؤول عن أي نزاعات مباشرة بين المستخدم والفندق.

# termsSection5Item2
source: We are not liable for losses resulting from circumstances beyond our control.
ar: لا نتحمل مسؤولية أي خسائر ناتجة عن ظروف خارجة عن السيطرة.

# termsSection6Title
source: 6. Governing Law
ar: 6. القانون الحاكم

# termsSection6Note
source: These terms and policies are governed by the laws of the country in which the app operates, and any dispute shall be resolved by the competent judicial authorities.
ar: تخضع هذه الشروط والسياسات لقوانين الدولة التي يعمل بها التطبيق، ويتم الفصل في أي نزاع عبر الجهات القضائية المختصة.

# termsSection7Title
source: 7. Cancellation and Refund Policy
ar: 7. سياسة الإلغاء والاسترجاع

# termsSection7Item1
source: Cancellation and refund policies vary from one hotel to another.
ar: تختلف سياسة الإلغاء والاسترجاع من فندق لآخر.

# termsSection7Item2
source: The cancellation policy is clearly displayed before booking confirmation.
ar: يتم عرض سياسة الإلغاء بوضوح قبل تأكيد الحجز.

# termsSection7Item3
source: Any refund is processed according to the hotel’s policy.
ar: أي استرجاع مالي يتم وفق سياسة الفندق.

# termsSection7Item4
source: The app is only responsible for forwarding cancellation/refund requests.
ar: يلتزم التطبيق بنقل طلب الإلغاء أو الاسترجاع فقط.

# termsSection8Title
source: 8. Content and Reviews Policy
ar: 8. سياسة المحتوى والتقييمات

# termsSection8Item1
source: Users may add reviews based on a genuine experience.
ar: يحق للمستخدمين إضافة تقييماتهم بناءً على تجربة حقيقية.

# termsSection8Item2
source: Posting abusive, misleading, or inappropriate content is prohibited.
ar: يمنع نشر أي محتوى مسيء أو مضلل أو غير لائق.

# termsSection8Item3
source: The app administration may remove violating content without prior notice.
ar: يحق لإدارة التطبيق حذف أي محتوى مخالف دون إشعار مسبق.

# termsSection9Title
source: 9. Support and Communication Policy
ar: 9. سياسة الدعم والتواصل

# termsSection9Item1
source: The app provides technical support channels for users.
ar: يوفر التطبيق قنوات دعم فني للمستخدمين.

# termsSection9Item2
source: Inquiries are responded to during official business hours.
ar: يتم الرد على الاستفسارات خلال أوقات العمل الرسمية.

# termsSection9Item3
source: Management may suspend or disable accounts that violate policies.
ar: يحق للإدارة تعليق أو إيقاف الحسابات المخالفة للسياسات.

# termsFooterNote
source: Last update: Dec 23, 2025. Terms and conditions may be updated from time to time and users will be notified of material changes within the app.
ar: آخر تحديث: 23 ديسمبر 2025. قد يتم تعديل الشروط والأحكام من وقت لآخر وسيتم إشعار المستخدم بالتغييرات الجوهرية داخل التطبيق.
