Repository: RaedMsood/Booking
Catalog: lib/l10n/intl_*.arb
Languages: ar

source: Done
ar: تم

source: Clear
ar: مسح

source: View more
ar: عرض المزيد

source: View All
ar: عرض الكل

source: All
ar: الكل

source: Confirm
ar: تأكيد

source: Following
ar: متابعة

source: More
ar: المزيد

source: Save
ar: حفظ

source: Yes
ar: نعم

source: No
ar: لا

source: Refresh
ar: تحديث

source: Copy
ar: نسخ

source: Sharing
ar: مشاركة

source: Delete
ar: حذف

source: Cancel
ar: إلغاء

source: Rename
ar: إعادة تسمية

source: Click again to exit!
ar: انقر مرة أخرى للخروج!

source: Read more
ar: قراءة المزيد

source: Show less
ar: عرض أقل

source: YER
ar: ريال

source: Home
ar: الرئيسية

source: Map
ar: الخريطة

source: My reservations
ar: حجوزاتي

source: Profile
ar: حسابي

source: Discover our destinations ✈️🌎
ar: اكتشف وجهاتنا ✈️🌎

source: Your hotel destination
ar: وجهتك الفندقية

# hotel
source: Mazaji
ar: مزاجي

source: Destinations
ar: الوجهات

# notificationsTitle
source: Notifications
ar: الإشعارات

source: Find the right place for you
ar: ابحث عن المكان المناسب لك

# searchSubtitle
source: You can search by property name and customize your results
ar: بإمكانك البحث باسم منشأة وقدرتة النتائج الخاصة بك

# searchHotelPlaceholder
source: Search for a hotel
ar: البحث عن فندق

source: No search results
ar: لايوجد نتائج للبحث

# filterTitle
source: Filter
ar: فلترة

source: Date
ar: التاريخ

source: Room type
ar: نوع الغرفة

source: Select room type
ar: اختر نوع الغرفة

source: Price
ar: السعر

source: Features
ar: المميزات

source: Rating
ar: التقييم

source: Apply filter
ar: فلترة

source: Clear filters
ar: تصفية الفلاتر

source: Nights
ar: ليال

source: Select dates
ar: اختر التواريخ

source: About
ar: عن الفندق

source: Comments
ar: التعليقات

source: Unable to open Maps app
ar: تعذّر فتح تطبيق الخرائط

source: Address
ar: العنوان

source: Show in map
ar: عرض في الخريطة

source: Deposit
ar: العربون

source: Hotel terms and policies
ar: شروط وسياسة الفندق

source: Hotel rooms
ar: غرف الفندق

# roomsFor
source: Rooms at
ar: الغرف الخاصة بـ

source: View details
ar: استعراض التفاصيل

source: Sections
ar: الأقسام

# reservationsTitle
source: Reservations
ar: الحجوزات

# allFilter
source: All
ar: الكل

# currentFilter
source: Current
ar: الحالية

# completedFilter
source: Completed
ar: مكتملة

# canceledFilter
source: Canceled
ar: ملغية

# bookingCodeCopied
source: Booking number copied
ar: تم نسخ رقم الحجز

# countLabel
source: Count
ar: عدد

source: Add your rating
ar: أضف تقييمك

source: Send
ar: ارسال

# openOffersWorldTitle
source: Open the door to your world of offers and bookings
ar: افتح الباب لعالم العروض والحجوزات الخاصة بك

# openOffersWorldSubtitle
source: Log in now to discover all the great opportunities we've prepared for you
ar: سجّل دخولك الآن لتكتشف كل ما وفرّناه لك من فرص رائعة

# mapTitle
source: Map
ar: الخريطة

# mapHeadline
source: Explore places on the map
ar: اطّلع على المنشآت في الخريطة

# mapSubhead
source: Use the search tool to locate places easily and quickly.
ar: استخدم أداة البحث لتحديد المواقع بسهولة وسرعة.

# bookingDetailsTitle
source: Booking details
ar: تفاصيل الحجز

source: Booking confirmation
ar: تأكيد الحجز

# bookingCodeLabel
source: Booking number
ar: رقم الحجز

# bookingDateLabel
source: Booking date
ar: تاريخ الحجز

# bookingStatusLabel
source: Booking status
ar: حالة الحجز

source: Booking info
ar: بيانات الحجز

# adultsCount
source: Adults
ar: عدد البالغين

# childrenCount
source: Children
ar: عدد الأطفال

source: Check-in date
ar: تاريخ بداية الحجز

source: Check-out date
ar: تاريخ نهاية الحجز

# purchaseAndCancellationPolicy
source: Purchase & cancellation policy
ar: سياسة الشراء والإلغاء

source: View venue details
ar: استعراض تفاصيل المنشأة

# hotelBookingTitle
source: Hotel booking
ar: حجز الفندق

source: Your booking date
ar: تاريخ حجزك

source: Select booking date
ar: اختر تاريخ الحجز

source: Check-in
ar: تاريخ الوصول

source: Check-out
ar: تاريخ المغادرة

# guestsSectionTitle
source: Guests information
ar: بيانات الأشخاص في الحجز

# bookingPurpose
source: Purpose of stay
ar: الغرض من الحجز

# purposeLeisure
source: Leisure
ar: ترفيه

# purposeBusiness
source: Business
ar: عمل

# purposeFamily
source: Family
ar: عائلي

# purposeOther
source: Other
ar: أخرى

# roomsCount
source: Rooms
ar: عدد الغرف

source: Adults
ar: كبار

source: Children
ar: أطفال

source: Increase
ar: زيادة

source: Decrease
ar: نقصان

source: Next
ar: التالي

source: Previous
ar: السابق

# validationSelectDate
source: Please select a booking date
ar: يرجى اختيار تاريخ الحجز

# validationGuestsRequired
source: Please set the number of guests
ar: يرجى تحديد عدد الضيوف

# validationRoomsRequired
source: Please set the number of rooms
ar: يرجى تحديد عدد الغرف

# validationMinOneAdult
source: At least one adult is required
ar: يلزم وجود شخص بالغ واحد على الأقل

# calendarToday
source: Today
ar: اليوم

# calendarClear
source: Clear dates
ar: مسح التواريخ

# calendarApply
source: Apply
ar: تطبيق

# personalInfoTitle
source: Personal information
ar: بيانات الشخص

# personOne
source: Person
ar: شخص

# personTwo
source: People
ar: شخصين

# personOther
source: People
ar: أشخاص

source: Invoice
ar: الفاتورة

source: Single bed
ar: سرير مفرد

source: Double bed
ar: سرير مزدوج

source: Available bed types
ar: أنواع الأسرة المتوفرة

source: Area
ar: المساحة

source: Length
ar: الطول

source: Width
ar: العرض

source: Book now
ar: حجز الآن

# confirmationSectionTitle
source: Booking confirmation
ar: تأكيد الحجز

# roomsShort
source: Rooms
ar: غرف

source: From
ar: من

source: To
ar: إلى

# depositSectionTitle
source: Deposit
ar: العربون

source: Pay deposit
ar: دفع العربون

# payDepositNote
source: Please pay the deposit to confirm the booking
ar: يرجى دفع العربون لتأكيد الحجز

# guestsInfoTitle
source: Guests details
ar: بيانات الحضور

# guestsSummaryFormat
source: {adults} person ({children} children)
ar: {adults} شخص ({children} أطفال)

# hotelPolicyPrefix
source: Hotel policy:
ar: سياسة الفندق:

# nonRefundablePolicy
source: Deposit amount is strictly non-refundable
ar: مبلغ العربون لا يُرجع مطلقًا

# depositPaymentTitle
source: Pay deposit
ar: دفع العربون

# haveCouponQuestion
source: Have a discount coupon?
ar: لديك قسيمة تخفيض؟

source: Coupon
ar: القسيمة

source: Enter coupon
ar: أدخل القسيمة

# verifyCoupon
source: Verify
ar: تحقق

# couponDiscount
source: Discount
ar: قيمة الخصم

source: Payment methods
ar: وسائل الدفع

source: Cost
ar: التكلفة

# grandTotal
source: Total
ar: الإجمالي

# depositAmount
source: Deposit
ar: العربون

source: Remaining after deposit
ar: المتبقي بعد العربون

# payAction
source: Pay
ar: الدفع

# pleaseSelectPaymentMethod
source: Please select a payment method
ar: يرجى اختيار وسيلة الدفع

# confirmDepositTitle
source: Pay the deposit to confirm the booking
ar: قم بدفع العربون لتأكيد الحجز

# hotelPolicyNote
source: Hotel policy: the deposit is strictly non-refundable
ar: سياسة الفندق: مبلغ العربون لا يُرجع مطلقًا

# hotelPaymentNote
source: You will need to pay the remaining amount to the hotel owner upon arrival
ar: سيتوجب عليك دفع باقي المبلغ لصاحب الفندق عند الوصول

# amountLabel
source: Amount
ar: المبلغ

# amountValidation
source: Please enter the amount
ar: يرجى إدخال المبلغ

# payKuraimiInstruction
source: The identification number is generated from Al Kuraimi app settings on first setup
ar: رقم التعريف يُولَّد من إعدادات تطبيق الكريمي لأول مرة

# payKuraimiCodeLabel
source: Identification code
ar: رمز التعريف

# payKuraimiCodeHint
source: Identification code
ar: رمز التعريف

# payKuraimiCodeEmptyError
source: Please enter the identification code
ar: يرجى إدخال رمز التعريف

# payJawaliInstruction
source: Enter the purchase code generated in the Jawali app
ar: أدخل كود الشراء المنشأ في تطبيق جوالي

# payJawaliCodeLabel
source: Purchase code
ar: كود الشراء

# payJawaliCodeHint
source: Purchase code
ar: كود الشراء

# payJawaliCodeEmptyError
source: Please enter the purchase code
ar: يرجى إدخال كود الشراء

source: Payment method
ar: طريقة الدفع

source: Confirm Payment
ar: تأكيد الدفع

# bookingConfirmed
source: Your booking has been confirmed successfully, thank you.
ar: تم تأكيد حجزك بنجاح، شكرًا لك.

source: Back to my bookings
ar: العودة إلى حجوزاتي

# personalInfo
source: Personal information
ar: البيانات الشخصية

source: Favorites
ar: المفضلة

source: General settings
ar: الإعدادات العامة

# aboutApp
source: About the app
ar: عن التطبيق

source: Contact us
ar: تواصل معنا

source: FAQ
ar: الأسئلة الشائعة

# shareApp
source: Share the app
ar: مشاركة التطبيق

# editPersonalInfoTitle
source: Edit personal information
ar: تعديل البيانات الشخصية

# editPersonalInfoSubtitle
source: Update your personal information
ar: قم بتحديث معلوماتك الشخصية

source: Save changes
ar: حفظ التعديلات

# aboutMazaji
source: Mazaji offers a refined booking experience for hotels, thoughtfully designed to match your lifestyle. It presents a curated selection of top hotels and chalets, with an elegant interface and a seamless booking process that provides comfort from the very first moment. Every detail in Mazaji is crafted to ensure trust, privacy, and ease of choice, with diverse options suitable for all budgets. Choose your destination, enjoy the experience, and let your mood lead the way. Mazaji… Because your stay reflects your mood.
ar: مزاجي هو تجربة حجز راقية صُممت لتواكب ذوقك الرفيع. يقدّم لك مجموعة مختارة من أفضل الفنادق ، مع واجهة أنيقة وخطوات حجز سلسة تمنحك الراحة منذ اللحظة الأولى. في مزاجي، كل تفصيلة صُممت لتمنحك الثقة، الخصوصية، وسهولة الاختيار، مع خيارات متنوعة تناسب جميع الميزانيات دون استثناء. اختر المكان، استمتع بالتجربة، ودع مزاجك يقودك. مزاجي… لأن الإقامة تعكس مزاجك.

source: Settings
ar: إعدادات

source: Language
ar: اللغة

source: Currency
ar: عملة

source: SIGN OUT
ar: تسجيل الخروج

source: Do you really want to sign out?
ar: هل تريد حقا تسجيل الخروج؟

source: Application language
ar: لغة التطبيق

source: Change currency
ar: تغيير العملة

source: Change Phone Number
ar: تغيير رقم الهاتف

# phoneNumberCurrent
source: Current phone number
ar: رقم الهاتف الحالي

# phoneNumberNew
source: New phone number
ar: رقم الهاتف الجديد

source: Delete account
ar: حذف الحساب

# deleteAccountConfirmation
source: Do you really want to delete your account? You will lose all related data.
ar: هل تريد حقا حذف حسابك؟ ستفقد جميع البيانات المتعلقة بك

# logoutConfirmation
source: Do you really want to log out? You will need to log in again to access your data.
ar: هل تريد حقا تسجيل الخروج؟ سيتوجب عليك تسجيل الدخول مرة أخرى للوصول إلى بياناتك

source: Resend code in
ar: إعادة إرسال الرمز خلال

source: Resend
ar: إعادة الإرسال

source: Code has been send to
ar: تم إرسال الرمز إلى

source: Please enter the verification code
ar: يرجى أدخال رمز التحقق

source: Verification code
ar: رمز التحقق

source: Log in
ar: تسجيل الدخول

source: Sign up
ar: إنشاء حساب

source: Full name
ar: الأسم

source: Phone
ar: الرقم

source: Phone number
ar: رقم الهاتف

# phonePlaceholder
source: Enter your phone number
ar: أدخل رقم الهاتف

# governorate
source: City
ar: المحافظة

# fullNamePlaceholder
source: Enter your full name
ar: اكتب اسمك الكامل

source: Select governorate
ar: اختر المحافظة

# governorateAmanatAlAsimah
source: Amanat Al Asimah
ar: أمانة العاصمة

# nameRequired
source: Name is required
ar: الأسم مطلوب

# invalidEmail
source: Invalid email address
ar: البريد الإلكتروني غير صالح

# phoneRequired
source: Phone is required
ar: الرقم مطلوب

source: Please enter phone number
ar: يرجى ادخال رقم هاتف

# phoneMustStartWith7
source: Phone number must start with 7 (Yemen)
ar: رقم الهاتف يجب أن يبدأ بـ 7 (اليمن)

# phoneMustBe9Digits
source: Phone number must not be less than 9 digits
ar: رقم الهاتف يجب ألا يقل عن 9 أرقام

# governorateRequired
source: Please select a governorate
ar: يرجى اختيار المحافظة

source: Email (optional)
ar: البريد الإلكتروني (اختياري)

source: Email
ar: البريد الإلكتروني

# emailRequired
source: Email is required
ar: البريد الالكتروني مطلوب

source: Birthdate (optional)
ar: تاريخ الميلاد (اختياري)

source: Enter birthdate
ar: إدخل تاريخ الميلاد

source: Gender
ar: الجنس

source: Male
ar: ذكر

source: Female
ar: أنثى

source: Or
ar: أو

source: Continue with google
ar: الاستمرار بجوجل Google

# continueWithFacebook
source: Facebook with Continue
ar: الاستمرار بالفيسبوك Facebook

source: Continue as guest
ar: المتابعة كزائر

# successfully
source: The operation was completed successfully
ar: تمت العملية بنجاح

source: Logout successfully
ar: تم تسجيل الخروج بنجاح

source: The modification has been completed successfully
ar: لقد تم التعديل بنجاح

source: Deleted successfully
ar: تم الحذف بنجاح

# profileUpdatedSuccess
source: Profile updated successfully
ar: تم تعديل البيانات الشخصية بنجاح

# phoneNumberUpdatedSuccess
source: Phone number changed successfully.
ar: تم تغيير رقم الهاتف بنجاح

# accountDeletedSuccess
source: Account deleted successfully.
ar: تم حذف الحساب بنجاح

# network
source: Sorry, no internet connection
ar: عذراً لا يوجد اتصال بالانترنت

# network2
source: Check your internet connection
ar: تحقق من إتصالك بشبكة الانترنت

# timeout
source: Sorry, there is an internet issue
ar: عذراً هناك مشكلة بالانترنت

source: Internal server error
ar: خطأ داخلي في الخادم

# internalServerError2
source: Please try again later or contact support
ar: يرجى المحاولة لاحقاً أو التواصل مع الدعم الفني

# notImplemented
source: Feature not supported on the server
ar: الميزة غير مدعومة على الخادم

# notImplemented2
source: Make sure the app is updated or contact support
ar: تأكد من تحديث التطبيق أو التواصل مع الدعم

source: Bad gateway
ar: بوابة غير صالحة

# badGateway2
source: Please try again shortly
ar: يرجى إعادة المحاولة بعد قليل

source: Service unavailable
ar: الخدمة غير متاحة حالياً

# serviceUnavailable2
source: Please try again later
ar: يرجى المحاولة لاحقاً

source: Gateway timeout
ar: انتهى وقت الاتصال بالخادم

# gatewayTimeout2
source: Check your internet connection or try again later
ar: تحقق من اتصالك بالإنترنت أو حاول لاحقاً

source: HTTP version not supported
ar: نسخة HTTP غير مدعومة

# httpVersionNotSupported2
source: Please update the app to the latest version
ar: تأكد من تحديث التطبيق إلى آخر إصدار

source: Something went wrong
ar: حدث خطأ ما

source: Please try again
ar: يرجى المحاولة مرة أخرى

# cannotReachServer
source: Unable to reach the server
ar: تعذّر الاتصال بالخادم

# checkInternetOrServiceUrl
source: Check your internet connection or service URL
ar: تحقق من اتصالك بالإنترنت أو رابط الخدمة

# receiveTimeout
source: Receiving data timed out
ar: انتهى وقت استلام البيانات

# receiveTimeout2
source: Please try again later or reduce the data size
ar: يرجى المحاولة لاحقاً أو تقليل حجم البيانات

# sendTimeout
source: Sending data timed out
ar: انتهى وقت إرسال البيانات

# sendTimeout2
source: Check your connection and try again
ar: تحقق من الاتصال وأعد الإرسال

# sslError
source: SSL certificate error
ar: مشكلة في شهادة الأمان

# sslError2
source: Ensure your certificate is configured or try again later
ar: تأكد من ضبط الشهادة أو حاول لاحقاً

# requestCancelled
source: Request was cancelled
ar: تم إلغاء الطلب

# requestCancelled2
source: Retry if the cancellation was unintentional
ar: أعد المحاولة إذا كان الإلغاء غير مقصود

# invalidApiUrl
source: Invalid service URL
ar: رابط الخدمة غير صالح

# invalidApiUrl2
source: Check the server address (Base URL) and try again
ar: تحقق من عنوان الخادم (Base URL) ثم أعد المحاولة

# privacyPolicyTitle
source: Privacy Policy
ar: سياسة الخصوصية

source: Copied to clipboard
ar: تم النسخ إلى الحافظة

# unableToOpenLink
source: Unable to open the link
ar: تعذر فتح الرابط

# ppHeaderTitle
source: Privacy Policy
ar: سياسة الخصوصية

# ppIntro
source: This policy explains how information is collected, used, and protected when you use the Mazaji app. Mazaji (hotel bookings) is owned and operated by Algonest.
ar: توضح هذه السياسة كيفية جمع واستخدام وحماية المعلومات عند استخدامك لتطبيق مزاجي. تطبيق مزاجي (حجوزات الفنادق) مملوك ومُدار من قبل Algonest.

# ppConsentNote
source: By using the app, you agree to this policy.
ar: باستخدامك للتطبيق فإنك توافق على هذه السياسة.

# ppPledgeTitle
source: Important Pledge
ar: تعهد مهم

# ppPledgeLine1
source: We do not collect your precise location, we do not use GPS, and we do not request location permissions.
ar: لا نجمع موقعك الجغرافي الدقيق ولا نستخدم GPS ولا نطلب أذونات الموقع.

# ppPledgeLine2
source: We may ask you to manually select your governorate (approximate location) to improve content and service display, and it will be stored in your account data.
ar: قد نطلب منك اختيار المحافظة يدويًا (موقع تقريبي) لتحسين عرض المحتوى والخدمات، ويتم حفظها ضمن بيانات حسابك.

# ppPledgeLine3
source: Maps in the app are used only to display partner hotels/properties locations and do not rely on the user's location.
ar: الخرائط داخل التطبيق لعرض مواقع الفنادق/المنشآت المتعاقدة فقط ولا تعتمد على موقع المستخدم.

# ppSection1Title
source: 1) Information We Collect
ar: 1) المعلومات التي نجمعها

# ppSection1Intro
source: We collect only what is necessary to create your account, process bookings, and provide support.
ar: نجمع فقط المعلومات اللازمة لإنشاء الحساب وإتمام الحجوزات وتقديم الدعم.

# ppSection1SubA
source: Account & Additional Information
ar: معلومات الحساب والمعلومات الإضافية

# ppS1A1
source: Name (required).
ar: الاسم (إلزامي).

# ppS1A2
source: Phone number (required) for OTP login, account security, and essential communication.
ar: رقم الهاتف (إلزامي) لتسجيل الدخول عبر رمز تحقق (OTP) وتأمين الحساب والتواصل الضروري.

# ppS1A3
source: Email (optional) if you provide it.
ar: البريد الإلكتروني (اختياري) إذا قمت بإدخاله.

# ppS1A4
source: Date of birth (optional) for improving experience and some personalization.
ar: تاريخ الميلاد (اختياري) لتحسين تجربة المستخدم وبعض التخصيص داخل التطبيق.

# ppS1A5
source: Governorate/region (manually entered approximate location) (required) to improve content and services display.
ar: المحافظة/المنطقة السكنية (موقع تقريبي يُدخل يدويًا) (إلزامي) لتحسين عرض المحتوى والخدمات المتاحة.

# ppS1A6
source: Gender (required) for improving experience and some personalization settings.
ar: النوع (الجنس) (إلزامي) لتحسين تجربة المستخدم وبعض إعدادات التخصيص.

# ppSection1SubB
source: Booking Information
ar: معلومات الحجز

# ppS1B1
source: Booking details (hotel/property, dates, number of guests, booking notes) (required when booking) to complete the booking and support.
ar: تفاصيل الحجز (الفندق/المنشأة، التواريخ، عدد النزلاء، ملاحظات الحجز) (إلزامية عند الحجز) لإتمام الحجز وخدمة العملاء.

# ppSection1SubC
source: Technical Information (Logged Automatically)
ar: معلومات تقنية (تُسجَّل تلقائيًا)

# ppS1C1
source: Some technical data may be logged (e.g., IP address, request time, and diagnostic data when errors occur). We do not use this data to track your location or for targeted advertising.
ar: قد يتم تسجيل بعض البيانات التقنية تلقائيًا مثل عنوان IP وتاريخ ووقت الطلب وبعض بيانات التشخيص عند حدوث أخطاء. لا نستخدم هذه البيانات لتتبع موقعك ولا لعرض إعلانات موجهة.

# ppLocationNote
source: We do not collect location data, do not use GPS, and do not request location permissions. The governorate/region is entered manually as approximate location only.
ar: لا نجمع بيانات الموقع (Location) ولا نستخدم GPS ولا نطلب أي إذن موقع. المحافظة/المنطقة يتم إدخالها يدويًا كموقع تقريبي فقط.

# ppOtpNote
source: OTP: A login verification code may be sent via SMS and the app may auto-fill the code for convenience. We do not read or store your messages and we do not request SMS read permission.
ar: رمز التحقق (OTP): يتم إرسال رمز تسجيل الدخول عبر SMS وقد يقوم التطبيق بملء الرمز تلقائيًا لتسهيل الدخول. لا نقوم بقراءة محتوى رسائلك أو تخزينها، ولا نطلب إذن قراءة الرسائل القصيرة.

# ppSection2Title
source: 2) App Permissions
ar: 2) الأذونات التي يطلبها التطبيق

# ppS2_1
source: INTERNET: to connect to our servers, display content, and complete bookings.
ar: INTERNET: للاتصال بخوادمنا وعرض المحتوى وإتمام الحجوزات.

# ppS2_2
source: POST_NOTIFICATIONS (if enabled): to send booking-related notifications (confirmation/updates/important alerts). You can disable notifications in device settings.
ar: POST_NOTIFICATIONS (إن فُعِّلت الإشعارات): لإرسال إشعارات مرتبطة بالحجوزات (تأكيد/تحديث/تنبيه مهم). يمكنك إيقافها من إعدادات الجهاز.

# ppS2Note
source: We do not request location, external storage, contacts, or SMS read permissions.
ar: لا نطلب إذن الموقع ولا إذن الوصول للملفات العامة ولا جهات الاتصال، ولا نطلب إذن قراءة الرسائل القصيرة.

# ppSection3Title
source: 3) How We Use Information
ar: 3) كيف نستخدم المعلومات

# ppS3_1
source: Create and manage accounts and authenticate users via OTP.
ar: إنشاء الحساب وإدارته وتسجيل الدخول عبر OTP.

# ppS3_2
source: Process and manage bookings and send related updates.
ar: إتمام الحجوزات وإدارتها وإرسال التحديثات المرتبطة بها.

# ppS3_3
source: Customer support and technical support.
ar: خدمة العملاء والدعم الفني.

# ppS3_4
source: Security, fraud prevention, and abuse prevention.
ar: الأمان ومنع الاحتيال وسوء الاستخدام.

# ppS3_5
source: Improve performance, stability, and overall user experience.
ar: تحسين الأداء والاستقرار وتجربة الاستخدام بشكل إجمالي.

# ppSection4Title
source: 4) Sharing Information
ar: 4) مشاركة المعلومات

# ppS4Intro
source: We do not sell or rent your data. We may share limited information only when needed:
ar: لا نبيع بياناتك ولا نؤجرها. قد نشارك معلومات محدودة عند الحاجة وفي الحدود التالية:

# ppS4_1
source: With the hotel/property: share necessary booking details (e.g., name, phone number, booking details) to complete your booking.
ar: مع الفندق/المنشأة: مشاركة بيانات الحجز اللازمة لإتمام الحجز وخدمتك (مثل الاسم ورقم الهاتف وتفاصيل الحجز).

# ppS4_2
source: External payment gateway: payments are processed via an external gateway and we do not store your card/bank details inside Mazaji. Payment processing is subject to the payment provider’s terms and privacy policy.
ar: بوابة الدفع الخارجية: يتم تنفيذ الدفع عبر بوابة دفع خارجية، ولا نقوم بتخزين بيانات بطاقتك/حسابك المالي داخل تطبيق مزاجي. تخضع عملية الدفع لسياسة وشروط مزود بوابة الدفع.

# ppS4_3
source: Service providers: hosting/infrastructure providers, with minimum access needed to operate the app.
ar: مزودو خدمات التشغيل: مثل الاستضافة والبنية التحتية، وبالحد الأدنى اللازم لتشغيل التطبيق.

# ppS4_4
source: Legal obligations: when required by law or competent authorities.
ar: التزامات قانونية: إذا طُلِب منا ذلك بموجب القانون أو أوامر الجهات المختصة.

# ppSection5Title
source: 5) Third-Party Services
ar: 5) خدمات الطرف الثالث

# ppS5_1
source: Google Maps: to display partner hotels/properties locations inside the app.
ar: Google Maps: لعرض مواقع الفنادق/المنشآت المتعاقدة داخل التطبيق.

# ppS5_2
source: Firebase Cloud Messaging: to send booking-related notifications (e.g., booking confirmation/updates). Technical identifiers such as notification tokens may be used for operational and security purposes.
ar: Firebase Cloud Messaging: لإرسال إشعارات مرتبطة بالحجوزات (مثل تأكيد/تحديث الحجز). قد يتم استخدام مُعرّفات تقنية مثل توكن الإشعارات لأغراض تشغيلية وأمنية.

# ppS5Note
source: Google may collect some data according to its policies when using Maps.
ar: قد تجمع Google بعض البيانات وفقًا لسياساتها عند استخدام الخرائط.

# ppGooglePrivacyLabel
source: Google Privacy Policy
ar: سياسة خصوصية Google

# ppGoogleDevTermsLabel
source: Google Developers Terms
ar: شروط Google Developers

# ppSection6Title
source: 6) Data Retention
ar: 6) الاحتفاظ بالبيانات

# ppS6_1
source: We keep account and booking data as long as the account is active or as needed to provide the service.
ar: نحتفظ ببيانات الحساب والحجوزات طالما كان الحساب نشطًا أو حسب الحاجة لتقديم الخدمة.

# ppS6_2
source: We may retain some data longer to meet legal requirements or resolve disputes.
ar: قد نحتفظ ببعض البيانات لفترة إضافية إذا تطلبت ذلك المتطلبات القانونية أو لتسوية النزاعات.
